{
    "Snow White": "Snow White is a princess of great beauty, which makes her stepmother, the Queen, jealous. The Queen daily asks her magic mirror who is the fairest in the land, always hoping it will say she is. One day, however, the mirror tells her that Snow White is now the fairest. Furious, the Queen decides to have the young girl killed. However, the huntsman she assigns to the task cannot bring himself to do it and lets Snow White escape. Lost in the forest and exhausted, she ends up at a house inhabited by seven dwarfs.",
    "Cinderella": "Cinderella is a young woman subjected to the authority of her stepmother, Lady Tremaine, and her two stepsisters, Anastasia and Drizella. Although she is mistreated, humiliated, and forced into the role of a servant, she maintains hope through her dreams. She believes that one day, her wishes for happiness will come true. Orphaned, only her fairy godmother and animal friends support and encourage her in her pursuit of love and happiness. Cinderella is also strong and determined; when the royal ball invitation arrives, she does everything she can to convince her stepmother that she deserves to attend like anyone else. However, her stepmother is cruel and does everything to prevent her from going. While Cinderella is seen in various outfits in her films—rags, a blue nightgown, a pink dress made by the animals (torn by the stepsisters), a blue magical gown from her godmother, and a white wedding dress—she is most often depicted in merchandise wearing the light-blue ball gown with glass slippers and long gloves.",
    "Aurora": "Princess Aurora is the only daughter of King Stefan and Queen Leah. She is portrayed as a kind, gentle, timid, and somewhat naive young woman who loves animals. Her love of romance is a dominant personality trait. At her christening, three good fairies bless her with grace, beauty, and a beautiful voice. Maleficent herself describes her: Indeed, I admit, she is of rare beauty. Her hair is golden as wheat, her lips the brightest rose, alas she now rests. The name Aurora comes from Perrault’s tale, where it was originally given to the daughter of the princess. Tchaikovsky applied the name to the princess in his 1890 ballet, which Disney later followed. In the Disney film, Rose is the alias given to Aurora to hide her from Maleficent; in the German version, this is also her name. In the first French version, she is called Églantine, which is the direct translation of Briar Rose. In some English translations, she is called Rosamond or Rosamund.",
    "Ariel": "In the 1989 film, Ariel is the youngest of King Triton's seven daughters, aged 16. She is adventurous and curious about the human world, which shocks her father, who forbids contact with humans and is deeply wary of them. Her best friend is a fish named Flounder, and she is close to Sebastian, a crab and her father’s advisor. Ariel secretly collects human objects in a hidden grotto. During the story, she saves Prince Eric and falls in love with him. After a conflict with her father, she visits the sea witch Ursula, trading her voice for human legs for three days to win Eric’s heart. She nearly succeeds in getting true love's kiss, but Ursula interferes. When time runs out, Ariel becomes a mermaid again. To save her, King Triton gives up his crown and trident to Ursula. Eric kills Ursula in the ensuing battle, and Triton restores Ariel’s human form permanently so she can marry Eric.",
    "Belle": "Belle lives in a small French village with her father Maurice, an inventor the locals think is mad. She loves books, exploration, and romance, often visiting the bookshop for new stories. Though admired for her beauty, many in her village find her odd and peculiar. Gaston pursues her, but she firmly rejects him. In the TV movie Descendants (2015), which takes place after Beauty and the Beast, Belle and Beast’s son, Prince Ben, is a central character.",
    "Jasmine": "A modern Disney heroine: independent, intelligent, bold, and guided by her heart. Jasmine feels stifled by palace life and her father's control. Just before her 16th birthday, when she is legally required to choose a suitor, she runs away and hides in the marketplace. There, she meets Aladdin, who helps her out of trouble with a merchant, beginning their love story. With the Sultan’s blessing, the poor thief and the beautiful princess eventually unite.",
    "Pocahontas": "Pocahontas is loosely based on the real-life figure Matoaka, also known as Pocahontas, which means little mischief in Powhatan. Disney presents her as a noble (chief’s daughter), spiritual, and wise young woman who helps others. She has a love of nature and adventure and seems to possess shamanic powers, communicating with nature, animals, and the elements, and understanding unknown languages. Unlike others in her tribe, she is open-minded and unafraid, serving as a bridge between her people and the foreigners.",
    "Mulan": "Mulan breaks away from traditional Disney princess roles and ancient Chinese expectations for women to be quiet, obedient, and reserved. She is brave, independent, clumsy, resourceful, and honest. At first unsure of herself and feeling like a disappointment to her family, she grows confident while helping save China. Her courage, determination, and ingenuity earn her the respect of others.",
    "Tiana": "Tiana is the first African-American Disney princess and the second American after Pocahontas. Her original name Maddy was changed due to concerns it resembled Mammy, a racially insensitive stereotype. Tiana is a talented waitress and chef who dreams of owning a restaurant like her father. She is a rough diamond who must learn key life lessons to become a true princess. Director John Musker described her as one of the strongest-willed Disney heroines. At 19, she is motivated, independent, and determined to do things her way. She learns that balance is necessary for happiness—love is just as important as career.",
    "Rapunzel": "Rapunzel is depicted as a beautiful girl with green eyes, naive, shy, and curious. Trapped in a tower by the wicked witch Mother Gothel, she spends her days playing with her chameleon friend Pascal and brushing her long, magical golden hair. She dreams of seeing the outside world, but her mother forbids it. She falls in love with Flynn Rider, a thief who accidentally finds her tower, and eventually marries him. Her magical hair has healing powers, activated by a spell. If cut, her hair turns brown, loses its magic, and never grows back. At the end, Flynn cuts her hair, and a final tear saves his life with the last of the magic.",
    "Merida": "At 16, Merida is the daughter of King Fergus and Queen Elinor, rulers of Dun Broch in the Scottish Highlands. She has long curly red hair, blue eyes, and wears a dark blue dress. Her rebellious and fiery nature causes constant conflict with her mother, who insists she marry to ensure the kingdom’s future. Merida prefers exploring the Highlands and practicing archery. Her father, more relaxed and fond of jokes, avoids scolding her, except under Elinor’s pressure. He is impulsive and madly in love with his wife."
}